rimtty/RoadWeave/firmware/experiments/halow_link/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_MM_RESET_N=1
CONFIG_MM_WAKE=2
CONFIG_MM_BUSY=5
CONFIG_MM_SPI_SCK=7
CONFIG_MM_SPI_MOSI=9
CONFIG_MM_SPI_MISO=8
CONFIG_MM_SPI_CS=4
CONFIG_MM_SPI_IRQ=3
CONFIG_MM_BCF_FILE="bcf_fgh100mhaamd.bin"
CONFIG_MM_CHIP_MM6108=y
# Country is only used by the explicitly enabled RF build, not preflight.
CONFIG_HALOW_COUNTRY_CODE="US"
# Wio-WM6180 does not wire BUSY/WAKE; driver disables power save after boot.
# CONFIG_HALOW_PS_MODE is not set
CONFIG_HALOW_AP_MODE=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
# Avoid automatic IPv6 traffic in this IPv4 bench test.
# CONFIG_LWIP_IPV6 is not set
# CONFIG_RW_LINK_RF_ENABLE is not set
